Time.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Time</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-15 13:31:33 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Time</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Timestamps </a></li>
<li><a href="#sec-2">2 Relative Dates </a></li>
<li><a href="#sec-3">3 Deadlines and Scheduling </a>
<ul>
<li><a href="#sec-3.1">3.1 write article about the Earth for the Guide </a></li>
<li><a href="#sec-3.2">3.2 Watch Rams game </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Repeated Tasks </a>
<ul>
<li><a href="#sec-4.1">4.1 Pay the rent </a></li>
<li><a href="#sec-4.2">4.2 Call Father </a></li>
<li><a href="#sec-4.3">4.3 Check the batteries in the smoke detectors </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Using the TODO feature </a>
<ul>
<li><a href="#sec-5.1">5.1 figure out how this TODO system works </a></li>
<li><a href="#sec-5.2">5.2 </a></li>
<li><a href="#sec-5.3">5.3 Plan trip to Philadelphia </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Timestamps </h3>
<div class="outline-text-3" id="text-1">

<p><span class="timestamp-wrapper"> <span class="timestamp">2013-08-15 Thu</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-15 Thu 12:35</span></span> <br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-15 Thu 12:35-23:59</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-15 Thu</span></span><br/>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> Relative Dates </h3>
<div class="outline-text-3" id="text-2">

<p>You can specify a relative date by giving, as the
<i>first</i> thing in the input: a plus/minus sign, a
number and a letter ([dwmy]) to indicate change
in days, weeks, months, or years.
</p>
<p>
With a single plus or minus, the date is always
relative to today.
</p>
<p>
The relative date feature can be used with the
following notations:
</p>


<pre class="example">+0      =&gt; today
.       =&gt; today
+4d     =&gt; four days from today
+4      =&gt; same as above
+2w     =&gt; two weeks from today
++5     =&gt; five days from default date
+2tue   =&gt; second Tuesday from now
</pre>



</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> Deadlines and Scheduling </h3>
<div class="outline-text-3" id="text-3">

<p>DEADLINE
</p>
</div>

<div id="outline-container-3.1" class="outline-4">
<h4 id="sec-3.1"><span class="section-number-4">3.1</span> <span class="todo TODO"> TODO</span> write article about the Earth for the Guide </h4>
<div class="outline-text-4" id="text-3.1">

<p>The editor in charge is <i>bbdb:Ford Prefect</i>
<span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-08-15 Thu -5d</span></span><br/>
</p>
<p>
SCHEDULED
</p></div>

</div>

<div id="outline-container-3.2" class="outline-4">
<h4 id="sec-3.2"><span class="section-number-4">3.2</span> <span class="todo TODO"> TODO</span> Watch Rams game </h4>
<div class="outline-text-4" id="text-3.2">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">SCHEDULED: </span> <span class="timestamp">2013-08-15 Thu</span></span>  <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-08-15 Thu</span></span><br/>
</p>
<p>
Inserting deadlines and schedules can be done using
some Emacs-fu along these lines:    
</p>


<pre class="example">C-c C-d        Insert 'DEADLINE' keyword along with a stamp.    
C-c C-s        Insert 'SCHEDULED' keyword along with a stamp.
C-c C-x C-k    Mark the current entry for agenda action.
C-c / d        Create sparse tree
C-c / b        Sparse tree for deadlines and scheduled items before a given date    
C-c / a        Sparse tree for deadlines and schedules items after a given date
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4"><span class="section-number-3">4</span> Repeated Tasks </h3>
<div class="outline-text-3" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-4">
<h4 id="sec-4.1"><span class="section-number-4">4.1</span> <span class="todo TODO"> TODO</span> Pay the rent </h4>
<div class="outline-text-4" id="text-4.1">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-08-15 Thu +1m</span></span><br/>
</p>
</div>

</div>

<div id="outline-container-4.2" class="outline-4">
<h4 id="sec-4.2"><span class="section-number-4">4.2</span> <span class="todo TODO"> TODO</span> Call Father </h4>
<div class="outline-text-4" id="text-4.2">

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-08-15 Thu ++1w</span></span><br/>
Marking this DONE will shift the date by at least one week,
but also by as many weeks as it takes to get this date into
the future. However, it stays on a Sunday, even if you
called and marked it done on Saturday.
</p></div>

</div>

<div id="outline-container-4.3" class="outline-4">
<h4 id="sec-4.3"><span class="section-number-4">4.3</span> <span class="todo TODO"> TODO</span> Check the batteries in the smoke detectors </h4>
<div class="outline-text-4" id="text-4.3">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5"><span class="section-number-3">5</span> Using the TODO feature </h3>
<div class="outline-text-3" id="text-5">


</div>

<div id="outline-container-5.1" class="outline-4">
<h4 id="sec-5.1"><span class="section-number-4">5.1</span> <span class="todo TODO"> TODO</span> figure out how this TODO system works </h4>
<div class="outline-text-4" id="text-5.1">

</div>

</div>

<div id="outline-container-5.2" class="outline-4">
<h4 id="sec-5.2"><span class="section-number-4">5.2</span> <span class="todo TODO"> TODO</span>  </h4>
<div class="outline-text-4" id="text-5.2">

</div>

</div>

<div id="outline-container-5.3" class="outline-4">
<h4 id="sec-5.3"><span class="section-number-4">5.3</span> <span class="todo TODO"> TODO</span> Plan trip to Philadelphia </h4>
<div class="outline-text-4" id="text-5.3">

<p><span class="timestamp-wrapper"> <span class="timestamp">2013-08-15 Thu</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-16 Fri</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-17 Sat</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-18 Sun</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-19 Mon</span></span><br/>
Leave my house <span class="timestamp-wrapper"> <span class="timestamp">2013-08-19 Mon 05:00</span></span>
Arrive in Phil <span class="timestamp-wrapper"> <span class="timestamp">2013-08-19 Mon 12:00</span></span>
Meet DrK <span class="timestamp-wrapper"> <span class="timestamp">2013-08-19 Mon xx:xx</span></span>
</p>
<p>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-20 Tue</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-21 Wed</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-22 Thu</span></span><br/>
<span class="timestamp-wrapper"> <span class="timestamp">2013-08-23 Fri</span></span><br/>
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-15 13:31:33 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
